{
  "BIP": "1",
  "Title": "BIP Purpose and Guidelines",
  "Author": "Amir Taaki <genjix@riseup.net>",
  "Comments-Summary": "No comments yet.",
  "Comments-URI": "https://github.com/bitcoin/bips/wiki/Comments:BIP-0001",
  "Status": "Replaced",
  "Type": "Process",
  "Created": "2011-09-19",
  "Superseded-By": "2",
  "sections": [
    {
      "header": "What is a BIP? {#what_is_a_bip}",
      "content": "BIP stands for Bitcoin Improvement Proposal. A BIP is a design document\nproviding information to the Bitcoin community, or describing a new\nfeature for Bitcoin or its processes or environment. The BIP should\nprovide a concise technical specification of the feature and a rationale\nfor the feature.\n\nWe intend BIPs to be the primary mechanisms for proposing new features,\nfor collecting community input on an issue, and for documenting the\ndesign decisions that have gone into Bitcoin. The BIP author is\nresponsible for building consensus within the community and documenting\ndissenting opinions.\n\nBecause the BIPs are maintained as text files in a versioned repository,\ntheir revision history is the historical record of the feature proposal."
    },
    {
      "header": "BIP Types {#bip_types}",
      "content": "There are three kinds of BIP:\n\n-   A Standards Track BIP describes any change that affects most or all\nBitcoin implementations, such as a change to the network protocol, a\nchange in block or transaction validity rules, or any change or\naddition that affects the interoperability of applications using\nBitcoin.\n-   An Informational BIP describes a Bitcoin design issue, or provides\ngeneral guidelines or information to the Bitcoin community, but does\nnot propose a new feature. Informational BIPs do not necessarily\nrepresent a Bitcoin community consensus or recommendation, so users\nand implementors are free to ignore Informational BIPs or follow\ntheir advice.\n-   A Process BIP describes a process surrounding Bitcoin, or proposes a\nchange to (or an event in) a process. Process BIPs are like\nStandards Track BIPs but apply to areas other than the Bitcoin\nprotocol itself. They may propose an implementation, but not to\nBitcoin\\'s codebase; they often require community consensus; unlike\nInformational BIPs, they are more than recommendations, and users\nare typically not free to ignore them. Examples include procedures,\nguidelines, changes to the decision-making process, and changes to\nthe tools or environment used in Bitcoin development. Any meta-BIP\nis also considered a Process BIP."
    },
    {
      "header": "BIP Work Flow {#bip_work_flow}",
      "content": "The BIP process begins with a new idea for Bitcoin. Each potential BIP\nmust have a champion \\-- someone who writes the BIP using the style and\nformat described below, shepherds the discussions in the appropriate\nforums, and attempts to build community consensus around the idea. The\nBIP champion (a.k.a. Author) should first attempt to ascertain whether\nthe idea is BIP-able. Posting to the\n[bitcoin-dev@lists.linuxfoundation.org](https://lists.linuxfoundation.org/mailman/listinfo/bitcoin-dev)\nmailing list (and maybe the [Development & Technical\nDiscussion](https://bitcointalk.org/index.php?board=6.0) forum) is the\nbest way to go about this.\n\nVetting an idea publicly before going as far as writing a BIP is meant\nto save both the potential author and the wider community time. Many\nideas have been brought forward for changing Bitcoin that have been\nrejected for various reasons. Asking the Bitcoin community first if an\nidea is original helps prevent too much time being spent on something\nthat is guaranteed to be rejected based on prior discussions (searching\nthe internet does not always do the trick). It also helps to make sure\nthe idea is applicable to the entire community and not just the author.\nJust because an idea sounds good to the author does not mean it will\nwork for most people in most areas where Bitcoin is used. Small\nenhancements or patches often don\\'t need standardisation between\nmultiple projects; these don\\'t need a BIP and should be injected into\nthe relevant Bitcoin development work flow with a patch submission to\nthe applicable Bitcoin issue tracker.\n\nOnce the champion has asked the Bitcoin community as to whether an idea\nhas any chance of acceptance, a draft BIP should be presented to the\n[bitcoin-dev](https://lists.linuxfoundation.org/mailman/listinfo/bitcoin-dev)\nmailing list. This gives the author a chance to flesh out the draft BIP\nto make it properly formatted, of high quality, and to address\nadditional concerns about the proposal. Following a discussion, the\nproposal should be sent to the bitcoin-dev list and the BIP editor with\nthe draft BIP. This draft must be written in BIP style as described\nbelow, else it will be sent back without further regard until proper\nformatting rules are followed.\n\nBIP authors are responsible for collecting community feedback on both\nthe initial idea and the BIP before submitting it for review. However,\nwherever possible, long open-ended discussions on public mailing lists\nshould be avoided. Strategies to keep the discussions efficient include:\nsetting up a separate SIG mailing list for the topic, having the BIP\nauthor accept private comments in the early design phases, setting up a\nwiki page or git repository, etc. BIP authors should use their\ndiscretion here.\n\nIt is highly recommended that a single BIP contain a single key proposal\nor new idea. The more focused the BIP, the more successful it tends to\nbe. If in doubt, split your BIP into several well-focused ones.\n\nThe BIP editors assign BIP numbers and change their status. Please send\nall BIP-related email to the BIP editor, which is listed under [BIP\nEditors](#BIP_Editors \"wikilink\") below. Also see [BIP Editor\nResponsibilities &\nWorkflow](#BIP_Editor_Responsibilities_Workflow \"wikilink\"). The BIP\neditor reserves the right to reject BIP proposals if they appear too\nunfocused or too broad.\n\nAuthors MUST NOT self assign BIP numbers, but should use an alias such\nas \\\"bip-johndoe-infinitebitcoins\\\" which includes the author\\'s\nname/nick and the BIP subject.\n\nIf the BIP editor approves, he will assign the BIP a number, label it as\nStandards Track, Informational, or Process, give it status \\\"Draft\\\",\nand add it to the BIPs git repository. The BIP editor will not\nunreasonably deny a BIP. Reasons for denying BIP status include\nduplication of effort, disregard for formatting rules, being too\nunfocused or too broad, being technically unsound, not providing proper\nmotivation or addressing backwards compatibility, or not in keeping with\nthe Bitcoin philosophy. For a BIP to be accepted it must meet certain\nminimum criteria. It must be a clear and complete description of the\nproposed enhancement. The enhancement must represent a net improvement.\nThe proposed implementation, if applicable, must be solid and must not\ncomplicate the protocol unduly.\n\nThe BIP author may update the Draft as necessary in the git repository.\nUpdates to drafts may also be submitted by the author as pull requests.\n\nStandards Track BIPs consist of two parts, a design document and a\nreference implementation. The BIP should be reviewed and accepted before\na reference implementation is begun, unless a reference implementation\nwill aid people in studying the BIP. Standards Track BIPs must include\nan implementation \\-- in the form of code, a patch, or a URL to same \\--\nbefore it can be considered Final.\n\nOnce a BIP has been accepted, the reference implementation must be\ncompleted. When the reference implementation is complete and accepted by\nthe community, the status will be changed to \\\"Final\\\".\n\nA BIP can also be assigned status \\\"Deferred\\\". The BIP author or editor\ncan assign the BIP this status when no progress is being made on the\nBIP. Once a BIP is deferred, the BIP editor can re-assign it to draft\nstatus.\n\nA BIP can also be \\\"Rejected\\\". Perhaps after all is said and done it\nwas not a good idea. It is still important to have a record of this\nfact.\n\nBIPs can also be superseded by a different BIP, rendering the original\nobsolete. This is intended for Informational BIPs, where version 2 of an\nAPI can replace version 1.\n\nThe possible paths of the status of BIPs are as follows:\n\n`<img src=bip-0001/process.png>`{=html}`</img>`{=html}\n\nSome Informational and Process BIPs may also have a status of \\\"Active\\\"\nif they are never meant to be completed. E.g. BIP 1 (this BIP)."
    },
    {
      "header": "What belongs in a successful BIP? {#what_belongs_in_a_successful_bip}",
      "content": "Each BIP should have the following parts:\n\n-   Preamble \\-- RFC 822 style headers containing meta-data about the\nBIP, including the BIP number, a short descriptive title (limited to\na maximum of 44 characters), the names, and optionally the contact\ninfo for each author, etc.\n\n```{=html}\n<!-- -->\n```\n-   Abstract \\-- a short (\\~200 word) description of the technical issue\nbeing addressed.\n\n```{=html}\n<!-- -->\n```\n-   Copyright/public domain \\-- Each BIP must either be explicitly\nlabelled as placed in the public domain (see this BIP as an example)\nor licensed under the Open Publication License.\n\n```{=html}\n<!-- -->\n```\n-   Specification \\-- The technical specification should describe the\nsyntax and semantics of any new feature. The specification should be\ndetailed enough to allow competing, interoperable implementations\nfor any of the current Bitcoin platforms (Satoshi, BitcoinJ,\nbitcoin-js, libbitcoin).\n\n```{=html}\n<!-- -->\n```\n-   Motivation \\-- The motivation is critical for BIPs that want to\nchange the Bitcoin protocol. It should clearly explain why the\nexisting protocol specification is inadequate to address the problem\nthat the BIP solves. BIP submissions without sufficient motivation\nmay be rejected outright.\n\n```{=html}\n<!-- -->\n```\n-   Rationale \\-- The rationale fleshes out the specification by\ndescribing what motivated the design and why particular design\ndecisions were made. It should describe alternate designs that were\nconsidered and related work, e.g. how the feature is supported in\nother languages.\n\n```{=html}\n<!-- -->\n```\n-   The rationale should provide evidence of consensus within the\ncommunity and discuss important objections or concerns raised during\ndiscussion.\n\n```{=html}\n<!-- -->\n```\n-   Backwards Compatibility \\-- All BIPs that introduce backwards\nincompatibilities must include a section describing these\nincompatibilities and their severity. The BIP must explain how the\nauthor proposes to deal with these incompatibilities. BIP\nsubmissions without a sufficient backwards compatibility treatise\nmay be rejected outright.\n\n```{=html}\n<!-- -->\n```\n-   Reference Implementation \\-- The reference implementation must be\ncompleted before any BIP is given status \\\"Final\\\", but it need not\nbe completed before the BIP is accepted. It is better to finish the\nspecification and rationale first and reach consensus on it before\nwriting code.\n\n```{=html}\n<!-- -->\n```\n-   The final implementation must include test code and documentation\nappropriate for the Bitcoin protocol."
    },
    {
      "header": "BIP Formats and Templates {#bip_formats_and_templates}",
      "content": "BIPs should be written in mediawiki or markdown format."
    },
    {
      "header": "BIP Header Preamble {#bip_header_preamble}",
      "content": "Each BIP must begin with an RFC 822 style header preamble. The headers\nmust appear in the following order. Headers marked with \\\"\\*\\\" are\noptional and are described below. All other headers are required.\n\nBIP: <BIP number>\nTitle: <BIP title>\nAuthor: <list of authors' real names and optionally, email addrs>\n* Discussions-To: <email address>\nStatus: <Draft | Active | Accepted | Deferred | Rejected |\nWithdrawn | Final | Superseded>\nType: <Standards Track | Informational | Process>\nCreated: <date created on, in ISO 8601 (yyyy-mm-dd) format>\n* Post-History: <dates of postings to bitcoin mailing list>\n* Replaces: <BIP number>\n* Superseded-By: <BIP number>\n* Resolution: <url>\n\nThe Author header lists the names, and optionally the email addresses of\nall the authors/owners of the BIP. The format of the Author header value\nmust be\n\n` Random J. User <address@dom.ain>`\n\nif the email address is included, and just\n\n` Random J. User`\n\nif the address is not given.\n\nIf there are multiple authors, each should be on a separate line\nfollowing RFC 2822 continuation line conventions.\n\nNote: The Resolution header is required for Standards Track BIPs only.\nIt contains a URL that should point to an email message or other web\nresource where the pronouncement about the BIP is made.\n\nWhile a BIP is in private discussions (usually during the initial Draft\nphase), a Discussions-To header will indicate the mailing list or URL\nwhere the BIP is being discussed. No Discussions-To header is necessary\nif the BIP is being discussed privately with the author, or on the\nbitcoin email mailing lists.\n\nThe Type header specifies the type of BIP: Standards Track,\nInformational, or Process.\n\nThe Created header records the date that the BIP was assigned a number,\nwhile Post-History is used to record the dates of when new versions of\nthe BIP are posted to bitcoin mailing lists. Both headers should be in\nyyyy-mm-dd format, e.g. 2001-08-14.\n\nBIPs may have a Requires header, indicating the BIP numbers that this\nBIP depends on.\n\nBIPs may also have a Superseded-By header indicating that a BIP has been\nrendered obsolete by a later document; the value is the number of the\nBIP that replaces the current document. The newer BIP must have a\nReplaces header containing the number of the BIP that it rendered\nobsolete."
    },
    {
      "header": "Auxiliary Files {#auxiliary_files}",
      "content": "BIPs may include auxiliary files such as diagrams. Image files should be\nincluded in a subdirectory for that BIP. Auxiliary files must be named\nBIP-XXXX-Y.ext, where \\\"XXXX\\\" is the BIP number, \\\"Y\\\" is a serial\nnumber (starting at 1), and \\\"ext\\\" is replaced by the actual file\nextension (e.g. \\\"png\\\")."
    },
    {
      "header": "Transferring BIP Ownership {#transferring_bip_ownership}",
      "content": "It occasionally becomes necessary to transfer ownership of BIPs to a new\nchampion. In general, we\\'d like to retain the original author as a\nco-author of the transferred BIP, but that\\'s really up to the original\nauthor. A good reason to transfer ownership is because the original\nauthor no longer has the time or interest in updating it or following\nthrough with the BIP process, or has fallen off the face of the \\'net\n(i.e. is unreachable or not responding to email). A bad reason to\ntransfer ownership is because you don\\'t agree with the direction of the\nBIP. We try to build consensus around a BIP, but if that\\'s not\npossible, you can always submit a competing BIP.\n\nIf you are interested in assuming ownership of a BIP, send a message\nasking to take over, addressed to both the original author and the BIP\neditor. If the original author doesn\\'t respond to email in a timely\nmanner, the BIP editor will make a unilateral decision (it\\'s not like\nsuch decisions can\\'t be reversed :)."
    },
    {
      "header": "BIP Editors {#bip_editors}",
      "content": "The current BIP editor is Luke Dashjr who can be contacted at\n<luke_bipeditor@dashjr.org>."
    },
    {
      "header": "BIP Editor Responsibilities & Workflow {#bip_editor_responsibilities_workflow}",
      "content": "The BIP editor subscribes to the Bitcoin development mailing list. All\nBIP-related correspondence should be sent (or CC\\'d) to\nluke_bipeditor@dashjr.org.\n\nFor each new BIP that comes in an editor does the following:\n\n-   Read the BIP to check if it is ready: sound and complete. The ideas\nmust make technical sense, even if they don\\'t seem likely to be\naccepted.\n-   The title should accurately describe the content.\n-   Edit the BIP for language (spelling, grammar, sentence structure,\netc.), markup (for reST BIPs), code style (examples should match BIP\n8 & 7).\n\nIf the BIP isn\\'t ready, the editor will send it back to the author for\nrevision, with specific instructions.\n\nOnce the BIP is ready for the repository it should be submitted as a\n\\\"pull request\\\" to the [bitcoin/bips](https://github.com/bitcoin/bips)\nrepository on GitHub where it may get further feedback.\n\nThe BIP editor will:\n\n-   Assign a BIP number (almost always just the next available number,\nbut sometimes it\\'s a special/joke number, like 666 or 3141) in the\npull request comments.\n\n```{=html}\n<!-- -->\n```\n-   Merge the pull request when the author is ready (allowing some time\nfor further peer review).\n\n```{=html}\n<!-- -->\n```\n-   List the BIP in [README.mediawiki](README.mediawiki \"wikilink\")\n\n```{=html}\n<!-- -->\n```\n-   Send email back to the BIP author with next steps (post to\nbitcoin-dev mailing list).\n\nThe BIP editors are intended to fulfill administrative and editorial\nresponsibilities. The BIP editors monitor BIP changes, and correct any\nstructure, grammar, spelling, or markup mistakes we see."
    },
    {
      "header": "History",
      "content": "This document was derived heavily from Python\\'s PEP-0001. In many\nplaces text was simply copied and modified. Although the PEP-0001 text\nwas written by Barry Warsaw, Jeremy Hylton, and David Goodger, they are\nnot responsible for its use in the Bitcoin Improvement Process, and\nshould not be bothered with technical questions specific to Bitcoin or\nthe BIP process. Please direct all comments to the BIP editors or the\nBitcoin development mailing list."
    },
    {
      "header": "Changelog",
      "content": "10 Oct 2015 - Added clarifications about submission process and BIP\nnumber assignment.\n\n01 Jan 2016 - Clarified early stages of BIP idea championing, collecting\ncommunity feedback, etc."
    }
  ]
}