{
  "BIP": "140",
  "Layer": "Consensus (soft fork)",
  "Title": "Normalized TXID",
  "Author": "Christian Decker <decker.christian@gmail.com>",
  "Comments-Summary": "No comments yet.",
  "Comments-URI": "https://github.com/bitcoin/bips/wiki/Comments:BIP-0140",
  "Status": "Rejected",
  "Type": "Standards Track",
  "Created": "2015-10-14",
  "License": "PD",
  "sections": [
    {
      "header": "Abstract",
      "content": "This BIP describes the use of normalized transaction IDs (NTXIDs) in\norder to eliminate transaction malleability, both in the third-party\nmodification scenario as well as the participant modification scenario.\nThe transaction ID is normalized by removing the signature scripts from\ntransactions before computing its hash. The normalized transaction\nhashes are then used during the signature creation and signature\nverification of dependent transactions."
    },
    {
      "header": "Motivation",
      "content": "Transaction malleability refers to the fact that transactions can be\nmodified, either by one of the signers by re-signing the transaction or\na third-party by modifying the signature representation. This is a\nproblem since any modification to the serialized representation also\nchanges the hash of the transaction, which is used by spending\ntransaction to reference the funds that are being transferred. If a\ntransaction is modified and later confirmed by ending up in the\nblockchain all transactions that depended on the original transaction\nare no longer valid, and thus orphaned.\n\nBIPs 62[^1] and 66[^2] alleviate the problem of third-party modification\nby defining a canonical representation of the signatures. However,\nchecking the canonical representation is complex and may not eliminate\nall sources of third-party malleability. Furthermore, these BIPs do not\naddress modifications by one of the signers, i.e., re-signing the\ntransaction, because signers can produce any number of signatures due to\nthe random parameter in ECDSA.\n\nThis proposal eliminates malleability by removing the malleable\nsignatures from the hash used to reference the outputs spent by a\ntransaction. The new hash used to reference an output is called the\n*normalized transaction ID*. The integrity of all data that is used to\nreference the output is guaranteed by the signature itself, and any\nmodification that would change the normalized transaction ID would also\ninvalidate the signature itself.\n\nBesides eliminating transaction malleability as a source of problems it\nalso allows the use of transaction templates. Transaction templates\nsimplify higher level protocols and allows new uses. They allow an\nunsigned template transaction to be used as a basis for a sequence of\ntransaction and only once the sequence matches the signers\\'\nexpectations they provide the necessary signatures for the template to\nbecome valid, thus opting in to the sequence."
    },
    {
      "header": "Specification",
      "content": "The use of normalized transaction IDs is introduced as a softfork. The\nspecification is divided into three parts:\n\n-   Computation of the normalized transaction ID\n-   Introduction of a new extensible signature verification opcode to\nenable softfork deployment\n-   Changes to the UTXO tracking to enable normalized transaction ID\nlookup"
    },
    {
      "header": "Normalized Transaction ID computation {#normalized_transaction_id_computation}",
      "content": "In order to calculate the normalized transaction ID, the signature\nscript is stripped from each input of the transaction of non-coinbase\ntransactions and each input is normalized. Stripping the signature\nscript is achieved by setting the script\\'s length to 0 and removing the\n`uchar[]` array from the `TxIn`.[^3] Inputs are then normalized by\nreplacing the hash of each previous transaction with its normalized\nversion if available, i.e., the normalized hash of the previous\ntransaction that created the output being spent in the current\ntransaction. Version 1 transactions do not have a normalized transaction\nID hence the non-normalized transaction ID is used for input\nnormalization.\n\nThe normalized transaction ID is then computed as the double `SHA 256`\nhash of the normalized transaction matching the existing transaction ID\ncomputation. The normalized transaction ID remains unchanged even if the\nsignatures of the transaction are replaced/malleated and describe a\nclass of semantically identical transactions. In the following we use\n*transaction instance ID* to refer to the transaction ID computed on the\ntransaction including signatures. Normalized transaction IDs for\ncoinbase transactions are computed with the signature script in the\ncoinbase input, in order to avoid hash collisions."
    },
    {
      "header": "OP_CHECKSIGEX",
      "content": "This BIP introduces a new opcode `OP_CHECKSIGEX` which replaces\n`OP_NOP4`. `OP_CHECKSIGEX` subsumes `OP_CHECKSIGVERIFY` and\n`OP_CHECKMULTISIGVERIFY`, and extends them by accepting a new `VERSION`\nparameter. The version parameter is a single integer pushed onto the\nstack before invoking `OP_CHECKSIGEX` and is used to group and evolve\nfuture versions of signature checking opcodes.\n\nWhen executed `OP_CHECKSIGEX` pops the version from the stack and then\nperforms the signature check according to the specified version. If the\nverifying client does not support the specified version, i.e., the\nversion was defined after the release of the client, the client must\ntreat the `OP_CHECKSIGEX` as an `OP_NOP`."
    },
    {
      "header": "Version 1 {#version_1}",
      "content": "The first version of `OP_CHECKSIGEX` (`VERSION=1`) implements normalized\ntransaction IDs and uses Schnorr signatures instead of the current ECDSA\nsignatures.\n\nVersion 1 introduces the following new standard script format:\n\n`   m {pubkey}...{pubkey} n v OP_CHECKSIGEX`\n\nwith matching scriptSig format:\n\n`   {signature}...{signature}`\n\nThis is the standard *m-of-n* script defined in [BIP\n11](https://github.com/bitcoin/bips/blob/master/bip-0011.mediawiki) with\nan additional version parameter `v` and the new opcode. Singlesig\ntransactions are encoded as *1-of-1* transactions.\n\nThe existing `OP_CHECKMULTISIG` and `OP_CHECKMULTISIGVERIFY` have a\nbug[^4] that pops one argument too many from the stack. This bug is not\nreproduced in the implementation of OP_CHECKSIGEX, so the canonical\nsolution of pushing a dummy value onto the stack is not necessary.\n\nThe normalization is achieved by normalizing the transaction before\ncomputing the signaturehash, i.e., the hash that is signed. The\ntransaction must be normalized by replacing all transaction IDs in the\ninputs by their normalized variants and stripping the signature scripts.\nThe normalized transction IDs are computed as described in the previous\nsection. This normalization step is performed both when creating the\nsignatures as well as when checking the signatures."
    },
    {
      "header": "Tracking Normalized Transaction IDs {#tracking_normalized_transaction_ids}",
      "content": "The transaction version is bumped to 2. The new version signals to\nclients receiving the transaction that they should track the normalized\ntransaction ID along with the transaction instance ID in the unspent\ntransaction output (UTXO) set. Upon receiving a version 2 transaction\nthe client computes the normalized transaction ID, annotates the outputs\nwith it, and adds them into the UTXO set indexed by the transaction\ninstance ID as before. Transactions continue using the transaction\ninstance ID to reference the outputs, but while checking the signature\nthey may get normalized. All network messages continue to use the\ntransaction instance ID to reference the transaction, specifically\n`inv`, `getdata`, `tx` and `block` messages still use transaction\ninstance IDs, not the normalized transaction IDs.\n\nOutputs created by version 1 transactions are not annotated with the\nnormalized transaction ID, and when normalizing the hashes in\ntransaction inputs referencing version 1 outputs are not modified."
    },
    {
      "header": "Rationale",
      "content": "### Normalization\n\nNormalized transaction IDs are provably non-malleable since no data is\nincluded in the signaturehash whose integrity is not also proven in the\nsignature, thus any modification causing the hash to change will also\ninvalidate the signature. Normalized transactions are secure as they\nstill use cryptographic hashes over all the semantic information of the\ntransaction, i.e., the inputs, outputs and metadata, thus it is still\ncomputationally infeasible to cause a hash collision between\ntransactions.\n\nThere are a number of advantages to using normalized transaction IDs:\n\n-   Like BIP 62 and BIP 66 it solves the problem of third-parties\npicking transactions out of the network, modifying them and\nreinjecting them.\n-   *m-of-n* multisig outputs are often used in higher level\nprotocols[^5]`<ref>`{=html}\\[\\[<http://lightning.network/lightning-network-paper.pdf%7CThe>\nBitcoin Lightning Network:\n\nScalable Off-Chain Instant Payments\\]\\]\n\n```{=html}\n</ref>\n```\nin which several parties sign a transaction. Without normalized\ntransaction IDs it is trivial for one party to re-sign a transaction,\nhence changing the transaction hash and invalidating any transaction\nbuilt on top of its outputs. Normalized transaction IDs force the ID not\nto change, even if a party replaces its signature.\n\n-   Many higher level protocols build structures of transactions on top\nof multisig outputs that are not completely signed. This is\ncurrently not possible without one party holding a fully signed\ntransaction and then calculating the ID. It is desirable to be able\nto build successive transactions without one party collecting all\nsignatures, and thus possibly lock in funds unilaterally. Normalized\ntransaction IDs allow the use of transaction templates, i.e.,\ncompletely unsigned transactions upon which further transactions can\nbe built, and only once every party is assured the structure matches\nits expectations it signs the template, thus validating the\ntemplate.\n\nThe only occurrence in which transactions can still be modified\nunilaterally is in the case `SIGHASH_NONE`, `SIGHASH_SINGLE` or\n`SIGHASH_ANYONECANPAY` is used. This however is not problematic since in\nthese cases the creator of the transaction explicitly allows\nmodification.\n\nIn case of a transaction becoming invalid due to one of the inputs being\nmalleated it is necessary to modify the spending transaction to\nreference the modified transaction ID. However, the signatures, which\nonly use the normalized IDs, remain valid as long as the semantics of\nthe funding transaction remain unchanged. An observer in the network may\nfix the transaction and reinject a corrected version.\n\nUsing version 2 for transactions is an explicit opt-in to the normalized\nID tracking and a simple upgrade for existing clients. It avoids having\nto reprocess the entire blockchain and computing the normalized\ntransaction IDs for existing outputs in the UTXO. This would be further\ncomplicated by having to recursively compute normalized transaction IDs\ndown to the coinbase transactions which created the coins.\n\nTracking the normalized transaction IDs in the UTXO requires the storage\nof an additional hash per transaction whose outputs are not completely\nspent, which at 7,000,000 transactions with unspent outputs amounts to\n224MB additional storage on disk.\n\nThe coinbase transactions have been checked for hash-collisions and no\ncollisions were found except for the coinbase transactions in blocks at\nheights 91842 and 91880, which are known to be identical[^6], and\nmotivated the introduction of BIP 34.[^7] Since coinbase transactions\nare invalid if transmitted outside of a block it is not possible to\nmodify them on the fly and since they only mature after being included\nfor a long time in the blockchain they are considered safe."
    },
    {
      "header": "OP_CHECKSIGEX {#op_checksigex_1}",
      "content": "The new opcode `OP_CHECKSIGEX` was introduced in order to allow the use\nof normalized transaction IDs as a softfork and in order to keep the\nnumber of `OP_NOP`s needed to a bare minimum, while enabling future\nsoft-fork updates to the signing algorithms.\n\nThe additional argument containing the version can be pushed on the\nstack using a single byte up to version 16 (`OP_1` - `OP_16`), resulting\nin one byte overhead for this script type. Using the standard multisig\nformat also for 1-of-1 transactions add an additional 2 bytes, however\nit also removes the bug requiring a dummy push, resulting in a single\nbyte overhead. Furthermore, using Schnorr signatures instead of ECDSA\nbrings a number of improvements that reduce the size of transactions\n(*m-of-m* is the same size as *1-of-1*) and increase verification speed\n(batch signature validation by summing up keys and signatures). The code\nis already in bitcoin/secp256k1 and can be merged in. We limited the\ndescription of this BIP to re-using BIP 11 style *m-of-n* scripts to\nkeep it short, however Schnorr also allows a number of more complex\napplications which we defer to future BIPs.\n\nVersion 0 was intentionally skipped in order to guarantee that the\ntop-most element before `OP_CHECKSIGEX` is non-zero. This is necessary\nto guarantee that non-upgraded clients, which interpret `OP_CHECKSIGEX`\nas `OP_NOP4`, do not end up with a zero value on top of the stack after\nexecution, which would be interpreted as script failure."
    },
    {
      "header": "Impact",
      "content": "This is a softfork which replaces `OP_NOP4` with the new implementation\nof `OP_CHECKSIGEX`, as such the impact on the network is minimal.\nWallets that do not implement this opcode will not be able to verify the\nvalidity of the scripts, however if transactions using `OP_CHECKSIGEX`\nare included in blocks they will accept them and track the inputs\ncorrectly. This is guaranteed since the transaction inputs still use the\nnon-normalized transaction ID to reference the outputs to be claimed,\nhence non-upgraded wallets can still lookup the outputs and mark them as\nspent. Furthermore, clients that do not implement this BIP are unable to\nidentify outputs using this script as their own, however upgrading and\nrescanning the blockchain will make them available."
    },
    {
      "header": "See also {#see_also}",
      "content": "-   [BIP 62: Dealing with malleability](bip-0062.mediawiki \"wikilink\")\n-   [BIP 66: Strict DER Signatures](bip-0066.mediawiki \"wikilink\")"
    },
    {
      "header": "References",
      "content": "```{=html}\n<references>\n```"
    },
    {
      "header": "Copyright",
      "content": "This document is placed in the public domain.\n\n[^1]: [BIP 62 - Dealing with\nmalleability](https://github.com/bitcoin/bips/blob/master/bip-0062.mediawiki \"wikilink\")\n\n[^2]: [BIP 66 - Strict DER\nsignatures](https://github.com/bitcoin/bips/blob/master/bip-0066.mediawiki \"wikilink\")\n\n[^3]: [Protocol Specification:\nTX](https://en.bitcoin.it/wiki/Protocol_Specification#tx \"wikilink\")\n\n[^4]: [Developer Documentation -\nMultisig](https://bitcoin.org/en/developer-guide#multisig \"wikilink\")\n\n[^5]: [A Fast and Scalable Payment Network with Bitcoin Duplex\nMicropayment Channels\n](http://www.tik.ee.ethz.ch/file/716b955c130e6c703fac336ea17b1670/duplex-micropayment-channels.pdf \"wikilink\")\n\n[^6]: [BIP 30 - Duplicate\ntransactions](https://github.com/bitcoin/bips/blob/master/bip-0030.mediawiki \"wikilink\")\n\n[^7]: [Block v2, Height in\nCoinbase](https://github.com/bitcoin/bips/blob/master/bip-0034.mediawiki \"wikilink\")"
    }
  ]
}